hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_clk.c
/* Paramer valid check for LRC state */
#define IS_VALID_CLK_LRC_STATE(STA)                                            \
(       ((STA) == CLK_LRC_OFF)                      ||                         \
        ((STA) == CLK_LRC_ON))

/* Paramer valid check for HRC frequency selection */
#define IS_VALID_CLK_HRCFREQ_SEL(SEL)                                          \
(       ((SEL) == CLK_HRCFREQ_32)                   ||                         \
        ((SEL) == CLK_HRCFREQ_16)                   ||                         \
        ((SEL) == CLK_HRCFREQ_8)                    ||                         \
        ((SEL) == CLK_HRCFREQ_4)                    ||                         \
        ((SEL) == CLK_HRCFREQ_2)                    ||                         \
        ((SEL) == CLK_HRCFREQ_1)

/* Paramer valid check for system clock source */
#define IS_VALID_CLK_SYSCLK_SRC(SRC)                                           \
(       ((SRC) == CLK_SYSCLKSOURCE_HRC)             ||                         \
        ((SRC) == CLK_SYSCLKSOURCE_XTAL)            ||                         \
        ((SRC) == CLK_SYSCLKSOURCE_LRC))

/* Paramer valid check for system clock divider */
#define IS_VALID_CLK_SYSCLK_DIV(DIV)                                           \
(       ((DIV) == CLK_SYSCLK_DIV1)                  ||                         \
        ((DIV) == CLK_SYSCLK_DIV2)                  ||                         \
        ((DIV) == CLK_SYSCLK_DIV4)                  ||                         \
        ((DIV) == CLK_SYSCLK_DIV8)                  ||                         \
        ((DIV) == CLK_SYSCLK_DIV16)                 ||                         \
        ((DIV) == CLK_SYSCLK_DIV32)                 ||                         \
        ((DIV) == CLK_SYSCLK_DIV64))

/* Paramer valid check for hclk divider */
#define IS_VALID_HCLK_DIV(DIV)                                                 \
(       ((DIV) == CLK_HCLK_DIV1)                    ||                         \
        ((DIV) == CLK_HCLK_DIV2)                    ||                         \
        ((DIV) == CLK_HCLK_DIV4)                    ||                         \
        ((DIV) == CLK_HCLK_DIV8)                    ||                         \
        ((DIV) == CLK_HCLK_DIV16)                   ||                         \
        ((DIV) == CLK_HCLK_DIV32))

/* Parameter valid check for CLK MCO clock source. */
#define IS_VALID_CLK_MCOSOURCE(SOURCE)                                         \
(       ((SOURCE) == CLK_MCOSOURCCE_HRC)            ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_LRC)            ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_XTAL)           ||                         \
        ((SOURCE) == CLK_MCOSOURCCE_SYSCLK))

/* Parameter valid check for CLK MCO clock Prescaler. */
#define IS_VALID_CLK_MCODIV(DIV)                                               \
(       ((DIV) == CLK_MCODIV_1)                     ||                         \
        ((DIV) == CLK_MCODIV_2)                     ||                         \
        ((DIV) == CLK_MCODIV_4)                     ||                         \
        ((DIV) == CLK_MCODIV_8)                     ||                         \
        ((DIV) == CLK_MCODIV_16)                    ||                         \
        ((DIV) == CLK_MCODIV_32)                    ||                         \
        ((DIV) == CLK_MCODIV_64)                    ||                         \
        ((DIV) == CLK_MCODIV_128))

/* Parameter valid check for CLK stable flag. */
#define IS_VALID_CLK_STB_FLAG(flag)                                            \
(       ((flag) == CLK_FLAG_HRCSTB)                 ||                         \
        ((flag) == CLK_FLAG_XTALSTB))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup CLK_Global_Functions CLK Global Functions
 * @{
 */
/**
  * @brief  Resets the CLK clock configuration to the default reset state.
  * @note   The default reset state of the clock configuration is given below:
  *            - LRC HRC ON and HRC used as system clock source
  *            - XTAL OFF
  *            - SysClk divider set to 1.
  *            - MCO OFF
  *            - All interrupts disabled
  * @param  None
  * @retval None
  */
void CLK_DeInit(void)
{
    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Reset peripheral clock */
    M0P_CMU->FCG = 0xFFFFFFFFu;

    /* Reset system clock / HCLK divider */
    M0P_CMU->SCKDIVR = 0x00u;
    M0P_CMU->PERICKSEL = 0x00u;

    /* Reset MCO */
    M0P_CMU->MCO1CFGR = 0x00u;

    /* Reset the system source */
    M0P_CMU->CKSWR = 0x00u;

    /* Reset HRC LRC XTAL */
    M0P_CMU->HRCCR = 0x00u;
    M0P_CMU->LRCCR = 0x00u;
    M0P_CMU->XTALCR = 0x01u;

    /* Reset XTALSTD */
    M0P_CMU->XTALSTDCR = 0x00u;

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Init Xtal initial structure with default value.
 * @param  pstcXtal specifies the parameter of XTAL.
 *            @arg    u8XtalState  : The new state of the XTAL.
 *            @arg    u8XtalMode   : The XTAL mode selection osc or exclk.
 *            @arg    u8XtalDrv    : The XTAL drive ability.
 *            @arg    u8XtalSupDrv : The XTAL super drive on or off.
 *            @arg    u8XtalStb    : The XTAL stable time selection.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t CLK_XtalStrucInit(stc_clk_xtal_init_t* pstcXtal)
{
    en_result_t enRet = Ok;

