hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_clk.c
    /* Check if pointer is NULL */
    if (NULL == pstcXtal)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcXtal->u8XtalState   = CLK_XTAL_OFF;
        pstcXtal->u8XtalMode    = CLK_XTALMODE_OSC;
        pstcXtal->u8XtalDrv     = CLK_XTALDRV_HIGH;
        pstcXtal->u8XtalSupDrv  = CLK_XTAL_SUPDRV_ON;
        pstcXtal->u8XtalStb     = CLK_XTALSTB_8;
    }

    return enRet;
}

/**
  * @brief  Initialise the XTAL.
  * @param  pstcXtal specifies the parameter of XTAL.
  *            @arg    u8XtalState  : The new state of the XTAL.
  *            @arg    u8XtalMode   : The XTAL mode selection osc or exclk.
  *            @arg    u8XtalDrv    : The XTAL drive ability.
  *            @arg    u8XtalSupDrv : The XTAL super drive on or off.
  *            @arg    u8XtalStb    : The XTAL stable time selection.
  * @retval en_result_t Status
  */
en_result_t CLK_XTALInit(const stc_clk_xtal_init_t* pstcXtal)
{
    uint32_t u32timeout = 0ul;
    en_result_t enRet = Ok;

    if (pstcXtal == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Paramers check */
        DDL_ASSERT(IS_VALID_CLK_XTAL_STATE(pstcXtal->u8XtalState));

        /* Enable register write. */
        CLK_REG_WRITE_ENABLE();

        if(CLK_XTAL_OFF == pstcXtal->u8XtalState)
        {
            /* When the XTAL is used as system clock in these case XTAL will not disabled */
            if(CLK_SYSCLKSOURCE_XTAL == READ_REG8_BIT(M0P_CMU->CKSWR, CMU_CKSWR_CKSW))
            {
                enRet = Error;
            }
            else
            {
                /* Disable XTAL */
                M0P_CMU->XTALCR = CLK_XTAL_OFF;
                /* Wait XTAL stop */
                while(CLK_FLAG_XTALSTB == READ_REG8_BIT(M0P_CMU->OSCSTBSR, CMU_OSCSTBSR_XTALSTBF))
                {
                    u32timeout++;
                    if(u32timeout > CLK_XTAL_TIMEOUT)
                    {
                        enRet = ErrorTimeout;
                        break;
                    }
                    else
                    {
                        /* code */
                    }
                }
            }
        }
        else
        {
            /* Paramers check */
            DDL_ASSERT(IS_VALID_CLK_XTAL_MODE(pstcXtal->u8XtalMode));
            DDL_ASSERT(IS_VALID_CLK_XTALDRV_MODE(pstcXtal->u8XtalDrv));
            DDL_ASSERT(IS_VALID_CLK_XTAL_SUPDRV_STATE(pstcXtal->u8XtalSupDrv));
            DDL_ASSERT(IS_VALID_CLK_XTALSTB_SEL(pstcXtal->u8XtalStb));

            /* Configure XTAL mode, driver ability, super_driver */
            M0P_CMU->XTALCFGR = pstcXtal->u8XtalDrv | pstcXtal->u8XtalMode | pstcXtal->u8XtalSupDrv;
            /* Configure XTAL stable time */
            M0P_CMU->XTALSTBCR = pstcXtal->u8XtalStb;
            /* Enable XTAL */
            M0P_CMU->XTALCR = CLK_XTAL_ON;
            /* Wait XTAL stable */
            while(CLK_FLAG_XTALSTB != READ_REG8_BIT(M0P_CMU->OSCSTBSR, CMU_OSCSTBSR_XTALSTBF))
            {
                u32timeout++;
                if(u32timeout > CLK_XTAL_TIMEOUT)
                {
                    enRet = ErrorTimeout;
					break;
                }
                else
                {
                    /* code */
                }
            }
        }

        /* Disbale register write. */
        CLK_REG_WRITE_DISABLE();
    }

    return enRet;
}

/**
 * @brief  Initialise the HRC.
 * @param  HRCState specifies the new state of HRC.
 *           This parameter can be one of the following values:
 *            @arg    CLK_HRC_OFF  : Disable HRC.
 *            @arg    CLK_HRC_ON   : Enable HRC.
 * @param  HRCFreq  specifies the frequency of HRC.
 *           This parameter can be one of the following values:
 *            @arg    CLK_HRCFREQ_32 : HRC frequency is 32MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_16 : HRC frequency is 16MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_8  : HRC frequency is 8MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_4  : HRC frequency is 4MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_2  : HRC frequency is 2MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_1  : HRC frequency is 1MHz while ICG.HRCFREQS[3] = 0.
 *            @arg    CLK_HRCFREQ_48 : HRC frequency is 48MHz while ICG.HRCFREQS[3] = 1.
 *            @arg    CLK_HRCFREQ_24 : HRC frequency is 24MHz while ICG.HRCFREQS[3] = 1.
 *            @arg    CLK_HRCFREQ_12 : HRC frequency is 12MHz while ICG.HRCFREQS[3] = 1.
 *            @arg    CLK_HRCFREQ_6  : HRC frequency is 6MHz while ICG.HRCFREQS[3] = 1.
 *            @arg    CLK_HRCFREQ_3  : HRC frequency is 3MHz while ICG.HRCFREQS[3] = 1.
 *            @arg    CLK_HRCFREQ_1P5: HRC frequency is 1.5MHz while ICG.HRCFREQS[3] = 1.
 * @retval en_result_t Status
 */
en_result_t CLK_HRCInit(uint8_t HRCState, uint8_t HRCFreq)
{
    uint32_t u32timeout = 0ul;
    en_result_t enRet = Ok;

    /* Paramers check */
    DDL_ASSERT(IS_VALID_CLK_HRC_STATE(HRCState));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    if(CLK_HRC_OFF == HRCState)
    {
        /* When the HRC is used as system clock in these case HRC will not disabled */
        if(CLK_SYSCLKSOURCE_HRC == READ_REG8_BIT(M0P_CMU->CKSWR, CMU_CKSWR_CKSW))
        {
            enRet = Error;
        }
        else
        {
            /* Disable HRC */
            M0P_CMU->HRCCR = CLK_HRC_OFF;
            /* Wait HRC stop */
            while(CLK_FLAG_HRCSTB == READ_REG8_BIT(M0P_CMU->OSCSTBSR, CMU_OSCSTBSR_HRCSTBF))
            {
                u32timeout++;
                if(u32timeout > CLK_TIMEOUT)
                {
                    enRet = ErrorTimeout;
					break;
                }
                else
                {
                    /* code */
                }
            }
        }
    }
    else
    {
        /* Paramers check */
        DDL_ASSERT(IS_VALID_CLK_HRC_FREQ_SEL(HRCFreq));

        /* Enable CMU_HRCCFGR register write */
        CLK_HRCCFGR_WRITE_ENBALE();

        /* Configure HRC frequency */
        M0P_EFM->HRCCFGR = HRCFreq;

        /* Disbale CMU_HRCCFGR register write */
        CLK_HRCCFGR_WRITE_DISABLE();

        /* Enable HRC */
        M0P_CMU->HRCCR = CLK_HRC_ON;
        /* Wait HRC stable */
        while(CLK_FLAG_HRCSTB != READ_REG8_BIT(M0P_CMU->OSCSTBSR, CMU_OSCSTBSR_HRCSTBF))
        {
            u32timeout++;
            if(u32timeout > CLK_TIMEOUT)
            {
                enRet = ErrorTimeout;
				break;
            }
            else
            {
                /* code */
            }
        }
    }

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();

    /* Update system clock */
    SystemCoreClockUpdate();

    return enRet;
}

/**
 * @brief  Initialise the LRC.
 * @param  LRCState specifies the new state of LRC.
 *           This parameter can be one of the following values:
 *            @arg    CLK_LRC_OFF  : Disable LRC.
 *            @arg    CLK_LRC_ON   : Enable LRC.
 * @retval en_result_t Status
 */
en_result_t CLK_LRCInit(uint8_t LRCState)
{
    en_result_t enRet = Ok;

    /* Paramers check */
    DDL_ASSERT(IS_VALID_CLK_LRC_STATE(LRCState));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    if(CLK_LRC_OFF == LRCState)
    {
        /* When the LRC is used as system clock in these case LRC will not disabled */
        if(CLK_SYSCLKSOURCE_LRC == READ_REG8_BIT(M0P_CMU->CKSWR, CMU_CKSWR_CKSW))
        {
            enRet = Error;
        }
        else
        {
            /* Disable LRC */
            M0P_CMU->LRCCR = CLK_LRC_OFF;
        }
    }
    else
    {
        /* Enable LRC */
        M0P_CMU->LRCCR = CLK_LRC_ON;
    }

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();

    return enRet;
}

/**
 * @brief  Init XtalStd initial structure with default value.
 * @param  pstcXtalStd specifies the parameter of XTALSTD.
 *            @arg    u8XtalStdState:   The new state of the XTALSTD.
 *            @arg    u8XtalStdMode:    The XTAL status detection occur interrupt or reset.
 *            @arg    u8XtalStdInt:     The XTAL status detection interrupt on or off.
 *            @arg    u8XtalStdRst:     The XTAL status detection reset on or off.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 */
en_result_t CLK_XtalStdStrucInit(stc_clk_xtalstd_init_t* pstcXtalStd)
{
    en_result_t enRet = Ok;

