hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_clk.c
    /* Check if pointer is NULL */
    if (NULL == pstcXtalStd)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configure to default value */
        pstcXtalStd->u8XtalStdState = CLK_XTALSTD_OFF;
        pstcXtalStd->u8XtalStdMode  = CLK_XTALSTD_MODE_INT;
        pstcXtalStd->u8XtalStdInt   = CLK_XTALSTD_RST_OFF;
        pstcXtalStd->u8XtalStdRst   = CLK_XTALSTD_INT_OFF;
    }

    return enRet;
}

/**
 * @brief  Initialise the XTAL status detection.
 * @param  pstcXtalStd specifies the parameter of XTALSTD.
 *            @arg    u8XtalStdState:   The new state of the XTALSTD.
 *            @arg    u8XtalStdMode:    The XTAL status detection occur interrupt or reset.
 *            @arg    u8XtalStdInt:     The XTAL status detection interrupt on or off.
 *            @arg    u8XtalStdRst:     The XTAL status detection reset on or off.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: Invalid parameter
 * 
 */
en_result_t CLK_XTALStdInit(const stc_clk_xtalstd_init_t* pstcXtalStd)
{
    en_result_t enRet = Ok;

    if (pstcXtalStd == NULL)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Paramer valid check */
        DDL_ASSERT(IS_VALID_CLK_XTALSTD_STATE(pstcXtalStd->u8XtalStdState));

        /* Enable register write. */
        CLK_REG_WRITE_ENABLE();

        if(CLK_XTALSTD_OFF == pstcXtalStd->u8XtalStdState)
        {
            /* Disbale XTAL status detection */
            CLEAR_REG8_BIT(M0P_CMU->XTALSTDCR, CMU_XTALSTDCR_XTALSTDE);
        }
        else
        {
            /* Paramer valid check */
            DDL_ASSERT(IS_VALID_CLK_XTALSTD_MODE(pstcXtalStd->u8XtalStdMode));
            DDL_ASSERT(IS_VALID_CLK_XTALSTD_INT_STATE(pstcXtalStd->u8XtalStdInt));
            DDL_ASSERT(IS_VALID_CLK_XTALSTD_RST_STATE(pstcXtalStd->u8XtalStdRst));

            /* Confiure XTALSTD and enable XTALSTD */
            M0P_CMU->XTALSTDCR = pstcXtalStd->u8XtalStdState | pstcXtalStd->u8XtalStdMode | \
                                pstcXtalStd->u8XtalStdInt   | pstcXtalStd->u8XtalStdRst;
        }
        /* Disbale register write. */
        CLK_REG_WRITE_DISABLE();
    }

    return enRet;
}

/**
 * @brief  Set the system clock source.
 * @param  u8Src specifies the source of system clock.
 *          This parameter can be one of the following values:
 *            @arg    CLK_SYSCLKSOURCE_HRC    : select HRC as system clock source
 *            @arg    CLK_SYSCLKSOURCE_XTAL   : select XTAL as system clock source
 *            @arg    CLK_SYSCLKSOURCE_LRC    : select LRC as system clock source
 * @retval None
 */
void CLK_SetSysclkSrc(uint8_t u8Src)
{
    DDL_ASSERT(IS_VALID_CLK_SYSCLK_SRC(u8Src));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Set system clock divider */
    MODIFY_REG8(M0P_CMU->CKSWR, CMU_CKSWR_CKSW, u8Src);

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();

    /* Update system clock */
    SystemCoreClockUpdate();
}

/**
 * @brief  Set the system clock divider.
 * @param  u8Div specifies the divider of system clock.
 *          This parameter can be one of the following values:
 *            @arg    CLK_SYSCLK_DIV1 : system clock 1 divider
 *            @arg    CLK_SYSCLK_DIV2 : system clock 2 divider
 *            @arg    CLK_SYSCLK_DIV4 : system clock 4 divider
 *            @arg    CLK_SYSCLK_DIV8 : system clock 8 divider
 *            @arg    CLK_SYSCLK_DIV16: system clock 16 divider
 *            @arg    CLK_SYSCLK_DIV32: system clock 32 divider
 * @retval None
 */
void CLK_SetSysclkDiv(uint8_t u8Div)
{
    DDL_ASSERT(IS_VALID_CLK_SYSCLK_DIV(u8Div));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Set system clock divider */
    MODIFY_REG8(M0P_CMU->SCKDIVR, CMU_SCKDIVR_SCKDIV, u8Div);

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();

    /* Update system clock */
    SystemCoreClockUpdate();
}

/**
 * @brief  Set the HCLK divider witch used as ADC clock.
 * @param  u8Div specifies the divider of HCLK.
 *          This parameter can be one of the following values:
 *            @arg    CLK_HCLK_DIV1 : HCLK 1 divider
 *            @arg    CLK_HCLK_DIV2 : HCLK 2 divider
 *            @arg    CLK_HCLK_DIV4 : HCLK 4 divider
 *            @arg    CLK_HCLK_DIV8 : HCLK 8 divider
 *            @arg    CLK_HCLK_DIV16: HCLK 16 divider
 *            @arg    CLK_HCLK_DIV32: HCLK 32 divider
 * @retval None
 */
void CLK_SetADClkDiv(uint8_t u8Div)
{
    DDL_ASSERT(IS_VALID_HCLK_DIV(u8Div));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Set system clock divider */
    MODIFY_REG8(M0P_CMU->PERICKSEL, CMU_PERICKSEL_PERICKSEL, u8Div);

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Enable or disable the FCG peripheral clock.
 * @note   After reset,the peripheral clock is disabled and the application
 *         software has to enable this clock before using it.
 * @param  u32FcgPeriph specifies the peripheral in FCG.
 *          This parameter can be one of the following values:
 *            @arg CLK_FCG_AD:       ADC clock
 *            @arg CLK_FCG_CT:       CTC clock
 *            @arg CLK_FCG_CM:       CMP clock
 *            @arg CLK_FCG_AO:       AOS clock
 *            @arg CLK_FCG_DMA:      DMA clock
 *            @arg CLK_FCG_CR:       CRC clock
 *            @arg CLK_FCG_TIMB1:    TIMB1 clock
 *            @arg CLK_FCG_TIMB2:    TIMB2 clock
 *            @arg CLK_FCG_TIMB3:    TIMB3 clock
 *            @arg CLK_FCG_TIMB4:    TIMB4 clock
 *            @arg CLK_FCG_TIM0:     TIM0 clock
 *            @arg CLK_FCG_TIM2:     TIM2 clock
 *            @arg CLK_FCG_TIM4:     TIM4 clock
 *            @arg CLK_FCG_TIMA:     TIMA clock
 *            @arg CLK_FCG_EMB:      EMB clock
 *            @arg CLK_FCG_UART1:    UART1 clock
 *            @arg CLK_FCG_UART2:    UART2 clock
 *            @arg CLK_FCG_UART3:    UART3 clock
 *            @arg CLK_FCG_I2C:      I2C clock
 *            @arg CLK_FCG_SPI:      SPI clock
 *
 * @param  enNewState specifies the new state of the clock output.
 *          This parameter can be one of the following values:
 *            @arg Enable:   Enable clock output.
 *            @arg Disable:  Disable clock output.
 * @retval None
 */
void CLK_FcgPeriphClockCmd(uint32_t u32FcgPeriph, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

