hdscmcu/hc32m120/DeviceDriverLibrary/hc32m120_ddl/driver/src/hc32m120_clk.c
    if(Enable == enNewState)
    {
        M0P_CMU->FCG &= ~u32FcgPeriph;
    }
    else
    {
        M0P_CMU->FCG |= u32FcgPeriph;
    }

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Selects the clock source to output on MCO pin.
 * @note   P15 should be configured in alternate function mode.
 * @param  CLK_MCOSource specifies the clock source to output.
 *          This parameter can be one of the following values:
 *            @arg CLK_MCOSOURCCE_HRC:       HRC clock selected as MCOx source
 *            @arg CLK_MCOSOURCCE_LRC:       LRC clock selected as MCOx source
 *            @arg CLK_MCOSOURCCE_XTAL:      XTAL clock selected as MCOx source
 *            @arg CLK_MCOSOURCCE_SYSCLK:    System clock(SYSCLK) selected as MCOx source
 * @param  CLK_MCODiv specifies the MCOx divider.
 *          This parameter can be one of the following values:
 *            @arg CLK_MCODIV_1:   no division applied to MCOx clock
 *            @arg CLK_MCODIV_2:   division by 2 applied to MCOx clock
 *            @arg CLK_MCODIV_4:   division by 4 applied to MCOx clock
 *            @arg CLK_MCODIV_8:   division by 8 applied to MCOx clock
 *            @arg CLK_MCODIV_16:  division by 16 applied to MCOx clock
 *            @arg CLK_MCODIV_32:  division by 32 applied to MCOx clock
 *            @arg CLK_MCODIV_64:  division by 64 applied to MCOx clock
 *            @arg CLK_MCODIV_128: division by 128 applied to MCOx clock
 * @retval None
 */
void CLK_MCOConfig(uint8_t CLK_MCOSource, uint8_t CLK_MCODiv)
{
    /* Check the parameters. */
    DDL_ASSERT(IS_VALID_CLK_MCOSOURCE(CLK_MCOSource));
    DDL_ASSERT(IS_VALID_CLK_MCODIV(CLK_MCODiv));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Configure the MCO */
    M0P_CMU->MCO1CFGR = (CLK_MCODiv | CLK_MCOSource);

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Enable or Disable MCO.
 * @param  enNewState specifies the new state of the clock output.
 *          This parameter can be one of the following values:
 *            @arg Enable:   Enable clock output.
 *            @arg Disable:  Disable clock output.
 * @retval None
 */
void CLK_MCOCmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    /* Enable or disable clock output. */
    bM0P_CMU->MCO1CFGR_b.MCO1EN = enNewState;

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Clear the XTAL error flag.
 * @param  None
 * @retval None
 * @note   The system clock should not be XTAL before call this function.
 */
void CLK_ClearXtalStdFlag(void)
{
    /* Enable register write. */
    CLK_REG_WRITE_ENABLE();

    if(CMU_XTALSTDSR_XTALSTDF == M0P_CMU->XTALSTDSR)
    {
        /* Clear the XTAL STD flag */
        CLEAR_REG8_BIT(M0P_CMU->XTALSTDSR, CMU_XTALSTDSR_XTALSTDF);
    }

    /* Disbale register write. */
    CLK_REG_WRITE_DISABLE();
}

/**
 * @brief  Get the xtal error flag.
 * @param  None
 * @retval en_flag_status_t
 */
en_flag_status_t CLK_GetXtalStdFlag(void)
{
    return(READ_REG8_BIT(M0P_CMU->XTALSTDSR, CMU_XTALSTDSR_XTALSTDF) ? Set : Reset);
}

/**
 * @brief  Get the clock stable flag.
 * @param  u8Flag  specifies the clock stable flag.
 *          This parameter can be one of the following values:
 *            @arg CLK_FLAG_HRCSTB:       HRC clock stable flag
 *            @arg CLK_FLAG_XTALSTB:      XTAL clock stable flag
 * @retval en_flag_status_t
 */
en_flag_status_t CLK_GetStableFlag(uint8_t u8Flag)
{
    en_flag_status_t enFlagStatus = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_CLK_STB_FLAG(u8Flag));

    if (Reset != (READ_REG8_BIT(M0P_CMU->OSCSTBSR, u8Flag)))
    {
        enFlagStatus = Set;
    }

    return enFlagStatus;
}

/**
 * @}
 */

#endif /* DDL_CLK_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
